## Descriptive Statistics:

### Types of data
1. numeical data :Numerical data consists of values that can be expressed as numbers. This type of data can further be divided into two subtypes: discrete and continuous.
   1. discrete data:Discrete data consists of distinct, separate values that are typically counted and are often whole numbers. These values cannot take on any value within a specific range. Examples include the number of students in a class, the count of cars in a parking lot, or the number of goals scored in a soccer game.
   2. continuous:Continuous data consists of values that can take on any real number within a certain range. These values are typically measured and can be represented as decimals or fractions. Examples include height, weight, temperature, or time. Continuous data can be divided into smaller and smaller intervals, making it possible to have values in between the defined measurements.
2. categorical data:Categorical data represents groups or categories, and the values are labels or names that do not have a numerical meaning. Categorical data can be further divided into nominal and ordinal data.
3. ordinal data:Ordinal data also represents categories, but the categories have a specific order or ranking. However, the differences between the categories are not necessarily uniform or quantifiable. Examples of ordinal data include educational levels (e.g., high school, bachelor's degree, master's degree) or customer satisfaction ratings (e.g., very unsatisfied, neutral, very satisfied).

### MEASURES IN DESCRIPTIVE  STATISTICS

1. Mean: Average of all the values
2. Median:Middle value of a dataset which is in increasing order.
   in case of even numbered data,take the sum of middle two numbers and divide by two
3. Mode:Value that appears most of the time in a dataset
4. Standard deviation : How much the value deviates/ differs from the mean value 
 less std deviation means the points are closer to the mean
 more std deviation means the points are farther to the mean
5. Variance : it is the average of squared deviation between the points
6. Correlation : measure of relationship between two variables
1. positive correlation : indicates direct relationship
2. negative correlation : indicates inverse relationship

In [5]:
import pandas as pd
df=pd.read_csv('D:\data.csv')
df

        name  age      country gender
0       john   23      germany      M
1     sophie   33      england      F
2  catherine   26           US      F
3       paul    3        India      M
4      peter   31       Russia      M
5     marial   24     Scotland      F
6      maxim   11       Sweden      M
7     george   30  Netherlands      F
8     grigor   31  south korea      M

In [8]:
df['age'].mean()

23.555555555555557

In [9]:
df.mode()

        name   age      country gender
0  catherine  31.0        India      M
1     george   NaN  Netherlands    NaN
2     grigor   NaN       Russia    NaN
3       john   NaN     Scotland    NaN
4     marial   NaN       Sweden    NaN
5      maxim   NaN           US    NaN
6       paul   NaN      england    NaN
7      peter   NaN      germany    NaN
8     sophie   NaN  south korea    NaN

In [11]:
df['age'].var()  #variance

103.52777777777779

In [12]:
df['age'].std()  #std deviation

10.174860086398132

In [13]:
df[df['age']>(df['age'].std())]

        name  age      country gender
0       john   23      germany      M
1     sophie   33      england      F
2  catherine   26           US      F
4      peter   31       Russia      M
5     marial   24     Scotland      F
6      maxim   11       Sweden      M
7     george   30  Netherlands      F
8     grigor   31  south korea      M

In [14]:
df['age'].median() #median

26.0

In [19]:
# correlation
df.corr()

C:\Users\HP\AppData\Local\Temp\ipykernel_7172\3045766373.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

     age
age  1.0